#include <iostream>
#include <array>

#include "Board.h"
#include "Game.h"
#include "Test.h"

int main() {

    //Test::shapeTest();
    //std::cout << " ┌ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┬ ┐ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ● ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ○ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ╋ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ╋ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ╋ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ╋ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ╋ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n ├ ┼ ┼ ┼ ┼ ┼😼 ┼ ┼ ┼ ┼ ┼ ┼ ┼ ┤ \n └ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┴ ┘ \n A B C D E F G H I J K L M N O "<< std::endl;
    //while(true) {}

    //
    Game game;
    game.init_game();
    game.game_turn();
    //

    return 0;
}